#********************************************************
# 回帰モデルの利用
#********************************************************

#========================================================
# データの生成
#========================================================
# 相関のある2つの乱数 x, z を発生させる関数
rcorr <- function(n=1000, r=1) {
	x <<- rnorm(n) 
	z <- rnorm(n) 
	z <<- r*x + sqrt(1-r^2)*z 
}

# 相関が0.8の乱数を500個発生させた
set.seed(202)
rcorr(500, 0.8)
# 確認
plot(x, z)
cor(x, z)

#========================================================
# 回帰
#========================================================
# x, zからyを作成
e <- rnorm(500)
y <- 1.5*x + 1.1*z + e

# xだけで回帰
resultX <- lm(y~x)
summary(resultX)

# 交絡因子zをモデルに追加
resultXZ <- lm(y~x+z)
summary(resultXZ)

# 図9
# (a)
par(mfrow=c(1,2)) 
curve(1.5*x, from =-1, to =1, lwd = 8, ylab = "y",xaxt="n", yaxt="n", col='gray',main="（a）")
abline(resultX, lwd = 4)
# (b)
curve(1.5*x, from =-1, to =1, lwd = 8, ylab = "y",xaxt="n", yaxt="n", col='gray',main="（b）")
abline(resultXZ, lwd = 4)



